{
  "planets": [
    {
      "id": 1,
      "name": "Sun",
      "image": "/assets/images/sun.webp",
      "type": "Gas Giant",
      "hadRings": "None",
      "diameterInKm": 1392000,
      "rotationSpeed": "6 875 km/h",
      "composition": "Hydrogen, Helium primarily, other gasses",
      "knownMoons": "None",
      "temperatureInC": "15000000",
      "temperatureInF": "2700000",
      "distanceFromSunInKm": 0,
      "description": "The sun is the center of our solar system.",
      "funFact": "The Sun is about 100 times wider than Earth and about 10 times wider than Jupiter, the biggest planet. "
    },
    {
      "id": 2,
      "name": "Mercury",
      "image": "/assets/images/mercury.webp",
      "type": "Terrestrial",
      "hadRings": "None",
      "diameterInKm": 4879,
      "rotationSpeed": "10 892 km/h",
      "composition": "Metals, Silical material",
      "knownMoons": "None",
      "temperatureInC": "-173",
      "temperatureInF": "-279",
      "distanceFromSunInKm": 70000000,
      "description": "Mercury is the planet closest to the Sun and the least massive of the Solar System.",
      "funFact": " Mercury is nearly tidally locked to the Sun and has the highest orbital eccentricity of all the planets, with its distance from the Sun ranging from 46 to 70 million km."
    },
    {
      "id": 3,
      "name": "Venus",
      "image": "/assets/images/venus.webp",
      "type": "Terrestrial ",
      "hadRings": "None",
      "diameterInKm": 12104,
      "rotationSpeed": "-395 km/h",
      "composition": "CO2, N2",
      "knownMoons": "None",
      "temperatureInC": "30 to 70",
      "temperatureInF": "86 to 158",
      "distanceFromSunInKm": 108000000,
      "description": "Venus is the second planet in the Solar System in order of distance from the Sun, and the sixth largest by mass and diameterInKm.",
      "funFact": "Venus has crushing air pressure at its surface  more than 90 times that of Earth  similar to the pressure you'd encounter a mile below the ocean on Earth, That means if you stood on it you'd be crushed. That's if the heat didn't get to you first."
    },
    {
      "id": 4,
      "name": "Earth",
      "image": "/assets/images/earth.webp",
      "type": "Terrestrial",
      "hadRings": "None",
      "diameterInKm": 12756,
      "rotationSpeed": "1 674 km/h",
      "composition": "Iron, Oxygen, Silicon, Magnesium, Sulfur, Nickel, Calcium, Aluminium",
      "knownMoons": "The Moon",
      "temperatureInC": "17",
      "temperatureInF": "69",
      "distanceFromSunInKm": 147147640,
      "description": "The Earth is the third planet in order of distance to the Sun and the fifth largest in the Solar System by both mass and diameterInKm.",
      "funFact": "Earth has never been perfectly round. The planet bulges around the equator by an extra 0.3 percent as a result of the fact that it rotates about its axis. Recent research from NASA's Jet Propulsion Laboratory suggests that melting glaciers are causing Earth's waistline to spread."
    },
    {
      "id": 5,
      "name": "Mars",
      "image": "/assets/images/mars.webp",
      "type": "Terrestrial",
      "hadRings": "None",
      "diameterInKm": 6779,
      "rotationSpeed": "868,22 km/h",
      "composition": "Iron, Nickel, Sulfur",
      "knownMoons": "Phobos, Deimos",
      "temperatureInC": "-153 to 20",
      "temperatureInF": "-225 to 70",
      "distanceFromSunInKm": 228000000,
      "description": "Mars is the fourth planet in the Solar System in ascending order of distance from the Sun and the second in ascending order of size and mass.",
      "funFact": "We're very interested in the question of water because it implies habitability; simply put, life as we know it is more likely to exist with water there. In fact, the Curiosity rover's mandate on Mars right now is to search for habitable environments (in the past or present)."
    },
    {
      "id": 6,
      "name": "Jupiter",
      "image": "/assets/images/jupiter.webp",
      "type": "Gas Giant",
      "hadRings": "Yes",
      "diameterInKm": 142984,
      "rotationSpeed": "43 000 km/h",
      "composition": "Hydrogen and Helium primarily",
      "knownMoons": "Io, Europa, Ganymede, Callisto (the largest) and 76 other moons",
      "temperatureInC": "-163",
      "temperatureInF": "-261.4",
      "distanceFromSunInKm": 778000000,
      "description": "Jupiter is the fifth planet of the Solar System in order of distance to the Sun, and the largest by size and mass in front of Saturn, which is like it a gas giant planet.",
      "funFact": "Jupiter has 80 moons that we know of, it might have even more. Fifty-seven moons have been given official names by the International Astronomical Union (IAU). Another 23 moons are awaiting official names."
    },
    {
      "id": 7,
      "name": "Saturn",
      "image": "/assets/images/saturn.webp",
      "type": "Gas Giant",
      "hadRings": "Yes",
      "diameterInKm": 120536,
      "rotationSpeed": "1 800 km/h",
      "composition": "Hydrogen and Helium, with traces of ices containing Ammonia, Methane, Water",
      "knownMoons": "Titan, Phoebe and 144 other moons",
      "temperatureInC": "-178",
      "temperatureInF": "-288",
      "distanceFromSunInKm": 1400000000,
      "description": "Saturn is the sixth planet of the Solar System in order of distance to the Sun, and the second largest by size and mass after Jupiter, which is like it a gas giant planet.",
      "funFact": "Saturn is home to a vast array of intriguing and unique worlds. From the haze-shrouded surface of Titan to crater-riddled Phoebe, each of Saturn's moons tells another piece of the story surrounding the Saturn system. As of June 8, 2023, Saturn has 146 moons in its orbit, with others continually awaiting confirmation of their discovery and official naming by the International Astronomical Union (IAU)."
    },
    {
      "id": 8,
      "name": "Uranus",
      "image": "/assets/images/uranus.webp",
      "type": "Gas Giant",
      "hadRings": "Yes",
      "diameterInKm": 51118,
      "rotationSpeed": "-360 to -118 km/h",
      "composition": "Hydrogen, Helium, Methane, Amoniac",
      "knownMoons": " Miranda, Ariel, Umbriel, Titania, Oberon and 22 other moons",
      "temperatureInC": "-218",
      "temperatureInF": "-360",
      "distanceFromSunInKm": 2900000000,
      "description": "Uranus is the 7th planet from the Sun, and the 3rd largest in the Solar System (4 times larger than the Earth). It is also the coldest planet with Neptune, endowed with a blue-green color from the presence of methane.",
      "funFact": "One day on Uranus takes about 17 hours which is the time it takes for Uranus to rotate on its axis once. And Uranus makes a complete orbit around the Sun (a year in Uranian time) in about 84 Earth years "
    },
    {
      "id": 9,
      "name": "Neptune",
      "image": "/assets/images/neptune.webp",
      "type": "Ice Giant",
      "hadRings": "Yes",
      "diameterInKm": 49244,
      "rotationSpeed": "1 440 km/h",
      "composition": "Ices, Hydrogen, Helium, Ammonia",
      "knownMoons": "Triton and 13 other moons",
      "temperatureInC": "-201",
      "temperatureInF": "-346",
      "distanceFromSunInKm": 4500000000,
      "description": "Neptune is the eighth planet in order of distance to the Sun and the furthest known from the Solar System.",
      "funFact": "Researchers discovered an ice giant exoplanet 25,000 light-years away in 2014. We don't know much about its composition, what it's made of, or what elements are present in its atmosphere, but it's in a similar orbit to its star as Uranus is to our Sun."
    }
  ]
}
